<?php

/**
* 这里面是存放的关于三权的一些定义
 */

return [
    'THREE_POWERS_USER' => [
        'default'   => 0,
        'admin'     => 1,
        'sysadmin'  => 2,
        'safeadmin' => 3,
        'auditor'   => 4,
        'operator'  => 5,
    ], // 三员用户类型定义
    'INIT_ROLE_LIST' => [
        2 => '695cd4e6-34c1-d55a-7526-c3ea8562112f', // 系统管理员
        3 => 'c6f7a389-145c-5182-b37b-642a39a68b95', // 安全管理员
        4 => '95cdc633-5eea-644c-3555-f051440608c0', // 安全审计员
        5 => 'b7345b13-692d-7d39-dd09-be42ae070238',  // 普通操作员
    ], // 初始化的角色的id集合
    'INIT_USER_LIST' => [
        '65ffef60-d838-70c3-0465-e3a53813210a', // 系统管理员
        '89f4a240-3a5f-4775-1cc7-4ab4db1a3700', // 安全管理员
        '32ab2234-8811-6110-0ce6-e025e1ecc080', // 安全审计员
        '96cf2fce-12c3-0dbf-a631-eb08b379fecf', // 普通操作员
    ], // 初始化用户列表
];
